iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32F2xx/emptyTargetInit/stm32f2_sfr.h
  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIF0COUNT:24;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFOCNT;

  uint8_t res1[52];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t FIFOData:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) FIFO;

};

#define SDIO_0 (*(volatile struct SDIO_0_tag *) 0x40018000)

struct RTC_2_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECIE:1;
      uint64_t ALRIE:1;
      uint64_t OWIE:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SECF:1;
      uint64_t ALRF:1;
      uint64_t OWF:1;
      uint64_t RSF:1;
      uint64_t CNF:1;
      uint64_t RTOFF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CRL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRLH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRLH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PRLL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) PRLL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVH:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DIVL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DIVL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CNTL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNTL;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALRH:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRH;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t ALRL:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) ALRL;

};

#define RTC_2 (*(volatile struct RTC_2_tag *) 0x40002800)

struct BKP_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t D1:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR1;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D2:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D3:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D4:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR4;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D5:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR5;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D6:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR6;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D7:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D8:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR8;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D9:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR9;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D10:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR10;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CAL:7;
      uint64_t CCO:1;
      uint64_t ASOE:1;
      uint64_t ASOS:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) RTCCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TPE:1;
      uint64_t TPAL:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t CTE:1;
      uint64_t CTI:1;
      uint64_t TPIE:1;
      uint64_t reservedSpace0:5;
      uint64_t TEF:1;
      uint64_t TIF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  uint8_t res0[8];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR11:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR11;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR12:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR12;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DR13:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR13;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D14:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR14;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D15:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR15;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D16:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR16;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D17:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR17;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D18:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR18;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D19:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR19;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D20:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR20;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D21:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR21;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D22:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR22;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D23:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR23;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D24:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR24;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D25:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR25;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D26:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR26;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D27:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR27;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D28:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR28;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D29:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR29;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D30:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR30;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D31:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR31;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D32:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR32;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D33:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR33;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D34:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR34;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D35:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR35;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D36:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR36;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D37:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR37;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D38:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR38;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D39:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR39;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D40:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR40;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D41:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR41;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t D42:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) DR42;

