iSYSTEMLabs/winIDEAExampleWorkspaces/ST/STM32F2xx/emptyTargetInit/stm32f2_sfr.h
  uint8_t res5[4];

  union
  {
    uint32_t R;
    struct
    {
      uint64_t EN:1;
      uint64_t TCIE:1;
      uint64_t HTIE:1;
      uint64_t TEIE:1;
      uint64_t DIR:1;
      uint64_t CIRC:1;
      uint64_t PINC:1;
      uint64_t MINC:1;
      uint64_t PSIZE:2;
      uint64_t MSIZE:2;
      uint64_t PL:2;
      uint64_t MEM2MEM:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CCR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t NDT:16;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CNDTR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CPAR7;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t MA:32;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CMAR7;

};

#define DMA (*(volatile struct DMA_tag *) 0x40020000)

struct RCC_0_tag
{
  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSION:1;
      uint64_t HSIRDY:1;
      uint64_t reservedSpace0:1;
      uint64_t HSITRIM:5;
      uint64_t HSICAL:8;
      uint64_t HSEON:1;
      uint64_t HSERDY:1;
      uint64_t HSEBYP:1;
      uint64_t CSSON:1;
      uint64_t reservedSpace1:4;
      uint64_t PLLON:1;
      uint64_t PLLRDY:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SW:2;
      uint64_t SWS:2;
      uint64_t HPRE:4;
      uint64_t PPRE:3;
      uint64_t reservedSpace0:3;
      uint64_t ADCPRE:2;
      uint64_t PLLSRC:1;
      uint64_t PLLXTPRE:1;
      uint64_t PLLMUL:4;
      uint64_t reservedSpace1:2;
      uint64_t MCO:3;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSIRDYF:1;
      uint64_t LSERDYF:1;
      uint64_t HSIRDYF:1;
      uint64_t HSERDYF:1;
      uint64_t PLLRDYF:1;
      uint64_t HSI14RDYF:1;
      uint64_t reservedSpace0:1;
      uint64_t CSSF:1;
      uint64_t LSIRDYIE:1;
      uint64_t LSERDYIE:1;
      uint64_t HSIRDYIE:1;
      uint64_t HSERDYIE:1;
      uint64_t PLLRDYIE:1;
      uint64_t HSI14RDYE:1;
      uint64_t reservedSpace1:2;
      uint64_t LSIRDYC:1;
      uint64_t LSERDYC:1;
      uint64_t HSIRDYC:1;
      uint64_t HSERDYC:1;
      uint64_t PLLRDYC:1;
      uint64_t HSI14RDYC:1;
      uint64_t reservedSpace2:1;
      uint64_t CSSC:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CIR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGRST:1;
      uint64_t reservedSpace0:8;
      uint64_t ADCRST:1;
      uint64_t reservedSpace1:1;
      uint64_t TIM1RST:1;
      uint64_t SPI1RST:1;
      uint64_t reservedSpace2:1;
      uint64_t USART1RST:1;
      uint64_t reservedSpace3:1;
      uint64_t TIM15RST:1;
      uint64_t TIM16RST:1;
      uint64_t TIM17RST:1;
      uint64_t reservedSpace4:3;
      uint64_t DBGMCURST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2RST:1;
      uint64_t TIM3RST:1;
      uint64_t reservedSpace0:2;
      uint64_t TIM6RST:1;
      uint64_t reservedSpace1:3;
      uint64_t TIM14RST:1;
      uint64_t reservedSpace2:2;
      uint64_t WWDGRST:1;
      uint64_t reservedSpace3:2;
      uint64_t SPI2RST:1;
      uint64_t reservedSpace4:2;
      uint64_t USART2RST:1;
      uint64_t reservedSpace5:3;
      uint64_t I2C1RST:1;
      uint64_t I2C2RST:1;
      uint64_t reservedSpace6:5;
      uint64_t PWRRST:1;
      uint64_t DACRST:1;
      uint64_t CECRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1RSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t DMAEN:1;
      uint64_t reservedSpace0:1;
      uint64_t SRAMEN:1;
      uint64_t reservedSpace1:1;
      uint64_t FLITFEN:1;
      uint64_t reservedSpace2:1;
      uint64_t CRCEN:1;
      uint64_t reservedSpace3:10;
      uint64_t IOPAEN:1;
      uint64_t IOPBEN:1;
      uint64_t IOPCEN:1;
      uint64_t IOPDEN:1;
      uint64_t reservedSpace4:1;
      uint64_t IOPFEN:1;
      uint64_t reservedSpace5:1;
      uint64_t TSCEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t SYSCFGEN:1;
      uint64_t reservedSpace0:8;
      uint64_t ADCEN:1;
      uint64_t reservedSpace1:1;
      uint64_t TIM1EN:1;
      uint64_t SPI1EN:1;
      uint64_t reservedSpace2:1;
      uint64_t USART1EN:1;
      uint64_t reservedSpace3:1;
      uint64_t TIM15EN:1;
      uint64_t TIM16EN:1;
      uint64_t TIM17EN:1;
      uint64_t reservedSpace4:3;
      uint64_t DBGMCUEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB2ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t TIM2EN:1;
      uint64_t TIM3EN:1;
      uint64_t reservedSpace0:2;
      uint64_t TIM6EN:1;
      uint64_t reservedSpace1:3;
      uint64_t TIM14EN:1;
      uint64_t reservedSpace2:2;
      uint64_t WWDGEN:1;
      uint64_t reservedSpace3:2;
      uint64_t SPI2EN:1;
      uint64_t reservedSpace4:2;
      uint64_t USART2EN:1;
      uint64_t reservedSpace5:3;
      uint64_t I2C1EN:1;
      uint64_t I2C2EN:1;
      uint64_t reservedSpace6:5;
      uint64_t PWREN:1;
      uint64_t DACEN:1;
      uint64_t CECEN:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) APB1ENR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSEON:1;
      uint64_t LSERDY:1;
      uint64_t LSEBYP:1;
      uint64_t LSEDRV:2;
      uint64_t reservedSpace0:3;
      uint64_t RTCSEL:2;
      uint64_t reservedSpace1:5;
      uint64_t RTCEN:1;
      uint64_t BDRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) BDCR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t LSION:1;
      uint64_t LSIRDY:1;
      uint64_t reservedSpace0:22;
      uint64_t RMVF:1;
      uint64_t OBLRSTF:1;
      uint64_t PINRSTF:1;
      uint64_t PORRSTF:1;
      uint64_t SFTRSTF:1;
      uint64_t IWDGRSTF:1;
      uint64_t WWDGRSTF:1;
      uint64_t LPWRRSTF:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CSR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t reservedSpace0:17;
      uint64_t IOPARST:1;
      uint64_t IOPBRST:1;
      uint64_t IOPCRST:1;
      uint64_t IOPDRST:1;
      uint64_t reservedSpace1:1;
      uint64_t IOPFRST:1;
      uint64_t reservedSpace2:1;
      uint64_t TSCRST:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) AHBRSTR;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t PREDIV:4;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR2;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t USART1SW:2;
      uint64_t reservedSpace0:2;
      uint64_t I2C1SW:1;
      uint64_t reservedSpace1:1;
      uint64_t CECSW:1;
      uint64_t reservedSpace2:1;
      uint64_t ADCSW:1;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CFGR3;

  union
  {
    uint32_t R;
    struct
    {
      uint64_t HSI14ON:1;
      uint64_t HSI14RDY:1;
      uint64_t HSI14DIS:1;
      uint64_t HSI14TRIM:5;
      uint64_t HSI14CAL:8;
    } __attribute__((packed)) B;
  } __attribute__((aligned(4))) CR2;

